In [1]:
import pandas as pd
import numpy as np

In [49]:
p=pd.read_table('Z:\\DA\\ud.csv',sep=',')

In [67]:
p

   NAME  REG NO  MARKS
0  uday     177     67
1   uda     178     68
2    ud     179     69
3     u     180     70

In [161]:
p=pd.read_table('Z:\\DA\\files\\ud.csv',sep=',')
p['NAME'][0]

'uday'

In [75]:
from os import system

In [86]:
m=pd.read_table('Z:\\DA\\ud.txt',sep='\t')
m

    'uday'  'kiran'
0  'kiran'   'uday'
1   'uday'  'kiran'
2  'kiran'   'uday'
3   'uday'  'kiran'

In [140]:
import json

obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

res=json.loads(obj)
df=pd.DataFrame(res['siblings'],columns=['name','age'])
df

    name  age
0  Scott   30
1  Katie   38

In [106]:
tables = pd.read_html("Z:\\DA\\files\\mpv.html")
len(tables)

1

In [171]:
m=pd.read_table('Z:\\DA\\files\\mpv.txt',sep=',')
m

   Name fwefwf
0  uday  jsere